{
    "FOOTER_LEGAL_NOTICE": "Impressum",
    "FOOTER_COPYRIGHT": "© David Eisenbarth 2026",
    "HEADER_NAME": "David Eisenbarth",
    "HEADER_ROLE": "FRONTEND ENTWICKLER",
    "NAV_WHY_ME": "Warum ich",
    "NAV_SKILLS": "Fähigkeiten",
    "NAV_PROJECTS": "Projekte",
    "NAV_CONTACT": "Kontakt",
    "LEGAL_TITLE": "Impressum",
    "LEGAL_IMPRINT": "Impressum",
    "LEGAL_OWNER_NAME": "•David Eisenbarth",
    "LEGAL_OWNER_ADDRESS1": "•Hauptstraße 1a",
    "LEGAL_OWNER_ADDRESS2": "•37339 Berlingerode",
    "LEGAL_EXPLORING_BOARD": "Überblick",
    "LEGAL_EMAIL": "davideisenbarth@gmail.com",
    "LEGAL_ACCEPTANCE_TITLE": "Akzeptanz der Bedingungen",
    "LEGAL_ACCEPTANCE_TEXT": "Durch den Zugriff auf und die Nutzung von Portfolio (Produkt) erkennen Sie die folgenden Allgemeinen Geschäftsbedingungen sowie alle Richtlinien, Leitlinien oder Änderungen an, die Ihnen von Zeit zu Zeit präsentiert werden. Wir, die aufgeführten Studenten, können die Bedingungen von Zeit zu Zeit ohne Vorankündigung aktualisieren oder ändern.",
    "LEGAL_SCOPE_TITLE": "Geltungsbereich und Eigentum des Produkts",
    "LEGAL_SCOPE_TEXT": "Portfolio wurde im Rahmen eines Studentenprojekts in einem Web-Development-Bootcamp bei der Developer Akademie GmbH entwickelt. Es dient Bildungszwecken und ist nicht für umfassende private oder geschäftliche Nutzung vorgesehen. Daher können wir keine konsistente Verfügbarkeit, Zuverlässigkeit, Genauigkeit oder andere Qualitätsaspekte des Produkts garantieren. Das Design von Portfolio gehört der Developer Akademie GmbH. Unbefugte Nutzung, Reproduktion, Modifikation, Verbreitung oder Nachbildung des Designs ist strengstens untersagt.",
    "LEGAL_PROPRIETARY_TITLE": "Eigentumsrechte",
    "LEGAL_PROPRIETARY_TEXT": "Abgesehen vom Design der Developer Akademie GmbH behalten wir, die aufgeführten Studenten, alle Eigentumsrechte an Portfolio, einschließlich aller damit verbundenen urheberrechtlich geschützten Materialien, Marken und sonstigen Eigentumsinformationen.",
    "LEGAL_USE_TITLE": "Verwendung des Produkts",
    "LEGAL_USE_TEXT": "Portfolio darf nur für rechtmäßige Zwecke genutzt werden, in Übereinstimmung mit allen geltenden Gesetzen und Vorschriften. Jegliche Nutzung von Portfolio für illegale Aktivitäten oder zur Belästigung, Schädigung, Bedrohung oder Einschüchterung anderer Personen ist strengstens verboten. Sie sind allein verantwortlich für Ihre Interaktionen mit anderen Nutzern von Portfolio.",
    "LEGAL_DISCLAIMER_TITLE": "Haftungsausschluss",
    "LEGAL_DISCLAIMER_TEXT": "Portfolio wird \"wie besehen\" ohne jegliche Gewährleistung bereitgestellt, sei es ausdrücklich oder stillschweigend, einschließlich, aber nicht beschränkt auf die stillschweigenden Gewährleistungen der Marktgängigkeit, Eignung für einen bestimmten Zweck und Nichtverletzung. Unter keinen Umständen haften wir, die aufgeführten Studenten, oder die Developer Akademie für direkte, indirekte, zufällige, besondere, Folgeschäden oder beispielhafte Schäden, einschließlich, aber nicht beschränkt auf Gewinne, Goodwill, Nutzung, Daten oder andere immaterielle Verluste, selbst wenn wir auf die Möglichkeit solcher Schäden hingewiesen wurden.",
    "LEGAL_INDEMNITY_TITLE": "Entschädigung",
    "LEGAL_INDEMNITY_TEXT": "Sie erklären sich damit einverstanden, uns, die aufgeführten Studenten, die Developer Akademie und unsere Partner, Mitarbeiter, Direktoren, Agenten und Angestellten schadlos zu halten und zu verteidigen gegen jegliche Ansprüche, Forderungen, Verluste, Schäden, Kosten oder Haftungen (einschließlich angemessener Anwaltskosten), die sich aus Ihrer Nutzung von Portfolio und/oder Ihrer Verletzung dieses Impressums ergeben. Für Fragen kontaktieren Sie uns bitte unter davideisenbarth@gmail.com. Datum: 14. Januar 2026",
    "PRIVACY_TITLE": "Datenschutzerklärung",
    "PRIVACY_SECTION1_TITLE": "1. Datenschutz auf einen Blick",
    "PRIVACY_SECTION1_GENERAL_TITLE": "Allgemeine Informationen",
    "PRIVACY_SECTION1_GENERAL_TEXT": "Die folgenden Informationen geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können.",
    "PRIVACY_SECTION1_COLLECTION_TITLE": "Datenerfassung auf dieser Website",
    "PRIVACY_SECTION1_COLLECTION_TEXT1": "Die Datenverarbeitung erfolgt durch den Websitebetreiber. Kontaktdaten finden Sie unten.",
    "PRIVACY_SECTION1_COLLECTION_TEXT2": "Ihre Daten werden erhoben, wenn Sie sie uns mitteilen (z. B. über Kontaktformulare). Andere Daten werden automatisch oder nach Ihrer Einwilligung durch unsere IT-Systeme erhoben (z. B. Browsertyp, Betriebssystem, Zeitpunkt des Seitenaufrufs).",
    "PRIVACY_SECTION1_COLLECTION_TEXT3": "Um den ordnungsgemäßen Betrieb der Website sicherzustellen und Anfragen zu bearbeiten.",
    "PRIVACY_SECTION1_COLLECTION_TEXT4": "Sie haben das Recht auf Auskunft, Berichtigung, Löschung, Einschränkung der Verarbeitung, Datenübertragbarkeit und das Recht, eine Beschwerde bei einer Aufsichtsbehörde einzureichen.",
    "PRIVACY_SECTION2_TITLE": "2. Hosting",
    "PRIVACY_SECTION2_TEXT1": "Diese Website wird extern gehostet. Personenbezogene Daten werden auf den Servern des Hosting-Anbieters gespeichert.",
    "PRIVACY_SECTION2_PROVIDER_LABEL": "Hosting-Anbieter:",
    "PRIVACY_SECTION2_PROVIDER_NAME": "InfinityFree",
    "PRIVACY_SECTION2_PROVIDER_ADDRESS": "Kwikstaartlaan 42, Unit G1517",
    "PRIVACY_SECTION2_PROVIDER_CITY": "3704 GS Zeist, Niederlande",
    "PRIVACY_SECTION2_PROVIDER_WEBSITE": "https://www.infinityfree.com",
    "PRIVACY_SECTION3_TITLE": "3. Verantwortlicher",
    "PRIVACY_SECTION3_NAME": "David Eisenbarth",
    "PRIVACY_SECTION3_ADDRESS": "Hauptstraße 1a",
    "PRIVACY_SECTION3_CITY": "37339 Berlingerode, Deutschland",
    "PRIVACY_SECTION3_PHONE": "Telefon: +49 151 22264080",
    "PRIVACY_SECTION3_EMAIL": "Email: davideisenbarth@gmail.com",
    "PRIVACY_SECTION4_TITLE": "4. Cookies",
    "PRIVACY_SECTION4_TEXT": "Diese Website verwendet Cookies. Cookies sind kleine Textdateien, die auf Ihrem Gerät gespeichert werden. Essenzielle Cookies werden auf Grundlage von Art. 6(1)(f) DSGVO verarbeitet.",
    "PRIVACY_SECTION5_TITLE": "5. Kontaktformular",
    "PRIVACY_SECTION5_TEXT": "Wenn Sie uns über ein Formular kontaktieren, werden Ihre Daten zur Bearbeitung Ihrer Anfrage gespeichert. Ihre Daten werden nicht ohne Ihre Zustimmung weitergegeben.",
    "PRIVACY_SECTION6_TITLE": "6. Social Media",
    "PRIVACY_SECTION6_TEXT": "Diese Website verwendet Social-Media-Plugins (z. B. Facebook) über die datenschutzfreundliche Shariff-Lösung. Die Datenübertragung erfolgt nur nach ausdrücklicher Einwilligung.",
    "PRIVACY_SECTION7_TITLE": "7. Google Fonts",
    "PRIVACY_SECTION7_TEXT": "Google Fonts werden lokal gehostet. Es wird keine Verbindung zu Google-Servern hergestellt.",
    "WHY_ME_TITLE": "Warum ich",
    "WHY_ME_REMOTE_HIGHLIGHT": "Ich bin",
    "WHY_ME_REMOTE_TEXT_1": "offen für",
    "WHY_ME_REMOTE_TEXT_2": "Remote-Arbeit aus Berlingerode!",
    "WHY_ME_DESCRIPTION": "Ich begeistere mich für Programmierung, weil sie analytisches Denken mit Kreativität verbindet. Besonders die Frontend-Entwicklung motiviert mich, da sie es mir ermöglicht, technische Lösungen in benutzerfreundliche und visuell ansprechende Oberflächen umzusetzen. Herausforderungen motivieren mich, lösungsorientiert zu denken und beharrlich zu arbeiten, bis Probleme gelöst sind. Durch meine Ausbildung zum Frontend Developer habe ich außerdem gelernt, wie wichtig Teamarbeit und Zusammenarbeit sind, um gemeinsam effiziente und gut strukturierte Lösungen zu entwickeln.",
    "WHY_ME_BUTTON": "Lass uns reden!"
}