{
    "FOOTER_LEGAL_NOTICE": "Impressum",
    "FOOTER_COPYRIGHT": "© David Eisenbarth 2026",
    "HEADER_NAME": "David Eisenbarth",
    "HEADER_ROLE": "FRONTEND ENTWICKLER",
    "NAV_WHY_ME": "Warum ich",
    "NAV_SKILLS": "Fähigkeiten",
    "NAV_PROJECTS": "Projekte",
    "NAV_CONTACT": "Kontakt",
    "LEGAL_TITLE": "Impressum",
    "LEGAL_IMPRINT": "Impressum",
    "LEGAL_OWNER_NAME": "•David Eisenbarth",
    "LEGAL_OWNER_ADDRESS1": "•Hauptstraße 1a",
    "LEGAL_OWNER_ADDRESS2": "•37339 Berlingerode",
    "LEGAL_EXPLORING_BOARD": "Überblick",
    "LEGAL_EMAIL": "davideisenbarth@gmail.com",
    "LEGAL_ACCEPTANCE_TITLE": "Akzeptanz der Bedingungen",
    "LEGAL_ACCEPTANCE_TEXT": "Durch den Zugriff auf und die Nutzung von Portfolio (Produkt) erkennen Sie die folgenden Allgemeinen Geschäftsbedingungen sowie alle Richtlinien, Leitlinien oder Änderungen an, die Ihnen von Zeit zu Zeit präsentiert werden. Wir, die aufgeführten Studenten, können die Bedingungen von Zeit zu Zeit ohne Vorankündigung aktualisieren oder ändern.",
    "LEGAL_SCOPE_TITLE": "Geltungsbereich und Eigentum des Produkts",
    "LEGAL_SCOPE_TEXT": "Portfolio wurde im Rahmen eines Studentenprojekts in einem Web-Development-Bootcamp bei der Developer Akademie GmbH entwickelt. Es dient Bildungszwecken und ist nicht für umfassende private oder geschäftliche Nutzung vorgesehen. Daher können wir keine konsistente Verfügbarkeit, Zuverlässigkeit, Genauigkeit oder andere Qualitätsaspekte des Produkts garantieren. Das Design von Portfolio gehört der Developer Akademie GmbH. Unbefugte Nutzung, Reproduktion, Modifikation, Verbreitung oder Nachbildung des Designs ist strengstens untersagt.",
    "LEGAL_PROPRIETARY_TITLE": "Eigentumsrechte",
    "LEGAL_PROPRIETARY_TEXT": "Abgesehen vom Design der Developer Akademie GmbH behalten wir, die aufgeführten Studenten, alle Eigentumsrechte an Portfolio, einschließlich aller damit verbundenen urheberrechtlich geschützten Materialien, Marken und sonstigen Eigentumsinformationen.",
    "LEGAL_USE_TITLE": "Verwendung des Produkts",
    "LEGAL_USE_TEXT": "Portfolio darf nur für rechtmäßige Zwecke genutzt werden, in Übereinstimmung mit allen geltenden Gesetzen und Vorschriften. Jegliche Nutzung von Portfolio für illegale Aktivitäten oder zur Belästigung, Schädigung, Bedrohung oder Einschüchterung anderer Personen ist strengstens verboten. Sie sind allein verantwortlich für Ihre Interaktionen mit anderen Nutzern von Portfolio.",
    "LEGAL_DISCLAIMER_TITLE": "Haftungsausschluss",
    "LEGAL_DISCLAIMER_TEXT": "Portfolio wird \"wie besehen\" ohne jegliche Gewährleistung bereitgestellt, sei es ausdrücklich oder stillschweigend, einschließlich, aber nicht beschränkt auf die stillschweigenden Gewährleistungen der Marktgängigkeit, Eignung für einen bestimmten Zweck und Nichtverletzung. Unter keinen Umständen haften wir, die aufgeführten Studenten, oder die Developer Akademie für direkte, indirekte, zufällige, besondere, Folgeschäden oder beispielhafte Schäden, einschließlich, aber nicht beschränkt auf Gewinne, Goodwill, Nutzung, Daten oder andere immaterielle Verluste, selbst wenn wir auf die Möglichkeit solcher Schäden hingewiesen wurden.",
    "LEGAL_INDEMNITY_TITLE": "Entschädigung",
    "LEGAL_INDEMNITY_TEXT": "Sie erklären sich damit einverstanden, uns, die aufgeführten Studenten, die Developer Akademie und unsere Partner, Mitarbeiter, Direktoren, Agenten und Angestellten schadlos zu halten und zu verteidigen gegen jegliche Ansprüche, Forderungen, Verluste, Schäden, Kosten oder Haftungen (einschließlich angemessener Anwaltskosten), die sich aus Ihrer Nutzung von Portfolio und/oder Ihrer Verletzung dieses Impressums ergeben. Für Fragen kontaktieren Sie uns bitte unter davideisenbarth@gmail.com. Datum: 14. Januar 2026",
    "PRIVACY_TITLE": "Datenschutzerklärung",
    "PRIVACY_SECTION1_TITLE": "1. Datenschutz auf einen Blick",
    "PRIVACY_SECTION1_GENERAL_TITLE": "Allgemeine Informationen",
    "PRIVACY_SECTION1_GENERAL_TEXT": "Die folgenden Informationen geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können.",
    "PRIVACY_SECTION1_COLLECTION_TITLE": "Datenerfassung auf dieser Website",
    "PRIVACY_SECTION1_COLLECTION_TEXT1": "Die Datenverarbeitung erfolgt durch den Websitebetreiber. Kontaktdaten finden Sie unten.",
    "PRIVACY_SECTION1_COLLECTION_TEXT2": "Ihre Daten werden erhoben, wenn Sie sie uns mitteilen (z. B. über Kontaktformulare). Andere Daten werden automatisch oder nach Ihrer Einwilligung durch unsere IT-Systeme erhoben (z. B. Browsertyp, Betriebssystem, Zeitpunkt des Seitenaufrufs).",
    "PRIVACY_SECTION1_COLLECTION_TEXT3": "Um den ordnungsgemäßen Betrieb der Website sicherzustellen und Anfragen zu bearbeiten.",
    "PRIVACY_SECTION1_COLLECTION_TEXT4": "Sie haben das Recht auf Auskunft, Berichtigung, Löschung, Einschränkung der Verarbeitung, Datenübertragbarkeit und das Recht, eine Beschwerde bei einer Aufsichtsbehörde einzureichen.",
    "PRIVACY_SECTION2_TITLE": "2. Hosting",
    "PRIVACY_SECTION2_TEXT1": "Diese Website wird extern gehostet. Personenbezogene Daten werden auf den Servern des Hosting-Anbieters gespeichert.",
    "PRIVACY_SECTION2_PROVIDER_LABEL": "Hosting-Anbieter:",
    "PRIVACY_SECTION2_PROVIDER_NAME": "InfinityFree",
    "PRIVACY_SECTION2_PROVIDER_ADDRESS": "Kwikstaartlaan 42, Unit G1517",
    "PRIVACY_SECTION2_PROVIDER_CITY": "3704 GS Zeist, Niederlande",
    "PRIVACY_SECTION2_PROVIDER_WEBSITE": "https://www.infinityfree.com",
    "PRIVACY_SECTION3_TITLE": "3. Verantwortlicher",
    "PRIVACY_SECTION3_NAME": "David Eisenbarth",
    "PRIVACY_SECTION3_ADDRESS": "Hauptstraße 1a",
    "PRIVACY_SECTION3_CITY": "37339 Berlingerode, Deutschland",
    "PRIVACY_SECTION3_PHONE": "Telefon: +49 151 22264080",
    "PRIVACY_SECTION3_EMAIL": "Email: davideisenbarth@gmail.com",
    "PRIVACY_SECTION4_TITLE": "4. Cookies",
    "PRIVACY_SECTION4_TEXT": "Diese Website verwendet Cookies. Cookies sind kleine Textdateien, die auf Ihrem Gerät gespeichert werden. Essenzielle Cookies werden auf Grundlage von Art. 6(1)(f) DSGVO verarbeitet.",
    "PRIVACY_SECTION5_TITLE": "5. Kontaktformular",
    "PRIVACY_SECTION5_TEXT": "Wenn Sie uns über ein Formular kontaktieren, werden Ihre Daten zur Bearbeitung Ihrer Anfrage gespeichert. Ihre Daten werden nicht ohne Ihre Zustimmung weitergegeben.",
    "PRIVACY_SECTION6_TITLE": "6. Social Media",
    "PRIVACY_SECTION6_TEXT": "Diese Website verwendet Social-Media-Plugins (z. B. Facebook) über die datenschutzfreundliche Shariff-Lösung. Die Datenübertragung erfolgt nur nach ausdrücklicher Einwilligung.",
    "PRIVACY_SECTION7_TITLE": "7. Google Fonts",
    "PRIVACY_SECTION7_TEXT": "Google Fonts werden lokal gehostet. Es wird keine Verbindung zu Google-Servern hergestellt.",
    "WHY_ME_TITLE": "Warum ich",
    "WHY_ME_REMOTE_HIGHLIGHT": "Ich bin",
    "WHY_ME_REMOTE_TEXT_1": "offen für",
    "WHY_ME_REMOTE_TEXT_2": "Remote-Arbeit aus Berlingerode!",
    "WHY_ME_DESCRIPTION": "Ich begeistere mich für Programmierung, weil sie analytisches Denken mit Kreativität verbindet. Besonders die Frontend-Entwicklung motiviert mich, da sie es mir ermöglicht, technische Lösungen in benutzerfreundliche und visuell ansprechende Oberflächen umzusetzen. Herausforderungen motivieren mich, lösungsorientiert zu denken und beharrlich zu arbeiten, bis Probleme gelöst sind. Durch meine Ausbildung zum Frontend Developer habe ich außerdem gelernt, wie wichtig Teamarbeit und Zusammenarbeit sind, um gemeinsam effiziente und gut strukturierte Lösungen zu entwickeln.",
    "WHY_ME_BUTTON": "Lass uns reden!",
    "SKILLS_TITLE": "Meine Fähigkeiten",
    "SKILLS_LEARNING_TITLE": "Ich lerne derzeit",
    "SKILLS_LEARNING_TITLE_MOBILE": "Was ich derzeit lerne",
    "SKILLS_LEARNING_TEXT": "Ich bin motiviert, meine Fähigkeiten kontinuierlich zu verbessern, innovative Lösungen umzusetzen und stets auf dem neuesten Stand neuer Technologien zu bleiben.",
    "CONTACT_TITLE": "Kontakt",
    "CONTACT_DESCRIPTION": "Gerne können Sie mich mit Jobangeboten oder Möglichkeiten wie Freelance-Arbeiten, Festanstellungen oder Kooperationen kontaktieren. Ich bin daran interessiert, meine Fähigkeiten in sinnvolle Projekte einzubringen und durch zuverlässige, qualitativ hochwertige Arbeit Mehrwert zu schaffen.",
    "CONTACT_EMAIL_LABEL": "E-Mail: davideisenbarth@gmail.com",
    "CONTACT_PHONE_LABEL": "Telefon: +49 151 22264080",
    "FORM_NAME_LABEL": "Ihr Name",
    "FORM_EMAIL_LABEL": "Ihre E-Mail",
    "FORM_MESSAGE_LABEL": "Ihre Nachricht",
    "FORM_PRIVACY_TEXT_BEFORE": "Ich habe die",
    "FORM_PRIVACY_LINK": "Datenschutzerklärung",
    "FORM_PRIVACY_TEXT_AFTER": "gelesen und stimme der Verarbeitung meiner Daten zu.",
    "FORM_SEND_BUTTON": "Senden",
    "FORM_POPUP_SUCCESS": "Die Nachricht wurde erfolgreich übermittelt.",
    "FORM_POPUP_OK": "OK",
    "TESTIMONIALS_TITLE": "Du suchst einen Teamplayer? Das sagen meine Kollegen über mich",
    "TESTIMONIALS_TITLE_MOBILE": "Du suchst einen Teamplayer?",
    "TESTIMONIAL_Subtitle_MOBILE": "Hier erfahren Sie, was meine Kollegen über mich sagen",
    "TESTIMONIAL_PROJECT": "Projekt",
    "TESTIMONIAL_LINKEDIN": "LinkedIn Profil",
    "TESTIMONIAL_1_TEXT": "David entwickelte, strukturierte und lieferte Inhalte in einem Einzelprojekt. Er ist eine zuverlässige und freundliche Person.",
    "TESTIMONIAL_2_TEXT": "David ist eine zuverlässige und freundliche Person. Er arbeitet strukturiert und schreibt sauberen Code. Ich empfehle ihn als Kollegen.",
    "TESTIMONIAL_3_TEXT": "Er ist ein vertrauenswürdiger Teamplayer und kann gut mit Termindruck umgehen. Strukturierte Arbeitsweise und sauberer Code.",
    "PROJECTS": {
        "TITLE": "Meine Projekte",
        "TABS": {
            "POKEDEX": "1. Pokedex",
            "ELPOLLOLOCO": "2. El pollo loco",
            "JOIN": "3. Join",
            "ONGOING": "4. Laufendes Projekt",
            "PROJECT": "Projekt"
        },
        "TECHNOLOGIES": "Technologien",
        "LIVE_TEST": "Live Test",
        "COMING_SOON": "Bald verfügbar ..."
    },
    "POKEDEX": {
        "ABOUT": {
            "TITLE": "Über das Projekt",
            "DURATION": "Dauer: 1 Woche",
            "CONTENT": "Diese App ist ein selbstgebautes Pokédex-App. Sie bietet einen umfassenden Überblick über Pokémon mit detaillierten Informationen, intuitiver Navigation und sauberem Interface, alles eigenständig entwickelt, um starke Problemlösungsfähigkeiten, strukturiertes Arbeiten und Liebe zum Detail zu demonstrieren.",
            "MOBILE": "Technologien: HTML, CSS, JavaScript <br> Dauer: 1 Woche"
        },
        "WORK": {
            "TITLE": "Wie ich meinen Arbeitsprozess organisiert habe",
            "CONTENT": "Mein Workflow war sorgfältig strukturiert und selbstverwaltet. Ich habe Funktionen Schritt für Schritt geplant, komplexe Aufgaben in überschaubare Teile zerlegt und die Anwendung kontinuierlich getestet und verfeinert, um sauberen Code, Zuverlässigkeit und stetigen Fortschritt sicherzustellen."
        },
        "LEARNED": {
            "TITLE": "Was ich gelernt habe",
            "CONTENT": "Durch dieses Projekt habe ich mein Skillset deutlich erweitert. Ich verbesserte meine Fähigkeit, eigenständig zu arbeiten, vertiefte mein Verständnis für strukturiertes Datenhandling und komponentenbasierte Entwicklung und sammelte wertvolle Erfahrungen in Planung, Problemlösung und Aufbau skalierbarer Anwendungen."
        }
    },
    "ELPOLLO": {
        "ABOUT": {
            "TITLE": "Über das Projekt",
            "DURATION": "Dauer: 5 Wochen",
            "CONTENT": "Ein einfaches Jump-and-Run-Spiel auf objektorientierter Basis. Hilf Pepe, Münzen und Giftflaschen zu finden, um gegen das Killerhuhn zu kämpfen.",
            "MOBILE": "Technologien: HTML, CSS, JavaScript <br> Dauer: 5 Wochen"
        },
        "WORK": {
            "TITLE": "Wie ich meinen Arbeitsprozess organisiert habe",
            "CONTENT": "Die Anwendung ist objektorientiert und in klare Klassen wie Spieler, Gegner, Items und Spielwelt unterteilt. Beschreibende Namen für Dateien, Variablen und Methoden machen den Code leicht verständlich. Wichtige Funktionen sind kurz dokumentiert, und die klare Struktur erlaubt einfache Erweiterungen oder Anpassungen von Spielmechaniken."
        },
        "LEARNED": {
            "TITLE": "Was ich gelernt habe",
            "CONTENT": "Durch dieses Projekt habe ich mein Skillset deutlich erweitert. Ich verbesserte meine Fähigkeit, eigenständig zu arbeiten, vertiefte mein Verständnis für strukturiertes Datenhandling und komponentenbasierte Entwicklung und sammelte wertvolle Erfahrungen in Planung, Problemlösung und Aufbau skalierbarer Anwendungen."
        }
    },
    "JOIN": {
        "ABOUT": {
            "TITLE": "Über das Projekt",
            "DURATION": "Dauer: 5 Wochen",
            "CONTENT": "Task Manager inspiriert vom Kanban-System. Aufgaben erstellen und organisieren mit Drag-and-Drop, Benutzer und Kategorien zuweisen.",
            "MOBILE": "Technologien: HTML, CSS, JavaScript"
        },
        "WORK": {
            "TITLE": "Wie ich meinen Arbeitsprozess organisiert habe",
            "CONTENT": "In unserem Gruppenprojekt mit HTML, CSS und Java strukturierten wir den Code übersichtlich und wartbar. Die Anwendung ist in klar getrennte Bereiche aufgeteilt (Struktur, Design, Logik). Wir verwenden sprechende Namen für Dateien, Variablen und Klassen und dokumentieren wichtige Stellen kurz im Code. Durch einfache Tests und gegenseitige Code-Reviews stellen wir die Qualität und Verständlichkeit sicher."
        },
        "LEARNED": {
            "TITLE": "Was ich gelernt habe",
            "CONTENT": "Wir waren zu dritt im Team, und die Rollen waren gleichmäßig verteilt. Meine Hauptaufgaben lagen bei Task-Management, Pinnwand, Impressum und Datenschutzseiten. Es war eine tolle Zusammenarbeit und ein erfolgreiches Projekt."
        }
    },
    "ONGOING": {
        "ABOUT": {
            "TITLE": "Über das Projekt",
            "DURATION": "Dauer: 3 Wochen",
            "CONTENT": "Diese App ist eine Slack Clone App. Sie revolutioniert die Teamkommunikation mit intuitiver Oberfläche, Echtzeit-Messaging und robuster Kanalorganisation. Zeigt den Wunsch, neue Technologien zu lernen und Fähigkeiten kontinuierlich zu verbessern.",
            "MOBILE_P": "Laufendes Projekt",
            "MOBILE": "Technologien: Angular, TypeScript, Firebase"
        }
    }
}