{
    "FOOTER_LEGAL_NOTICE": "Legal notice",
    "FOOTER_COPYRIGHT": "© David Eisenbarth 2026",
    "HEADER_NAME": "David Eisenbarth",
    "HEADER_ROLE": "FRONTEND DEVELOPER",
    "NAV_WHY_ME": "Why me",
    "NAV_SKILLS": "Skills",
    "NAV_PROJECTS": "Projects",
    "NAV_CONTACT": "Contact",
    "LEGAL_TITLE": "Legal Notice",
    "LEGAL_IMPRINT": "Imprint",
    "LEGAL_OWNER_NAME": "•David Eisenbarth",
    "LEGAL_OWNER_ADDRESS1": "•Hauptstraße 1a",
    "LEGAL_OWNER_ADDRESS2": "•37339 Berlingerode",
    "LEGAL_EXPLORING_BOARD": "Exploring the Board",
    "LEGAL_EMAIL": "davideisenbarth@gmail.com",
    "LEGAL_ACCEPTANCE_TITLE": "Acceptance of terms",
    "LEGAL_ACCEPTANCE_TEXT": "By accessing and using Portfolio (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions from time to time without notice.",
    "LEGAL_SCOPE_TITLE": "Scope and ownership of the product",
    "LEGAL_SCOPE_TEXT": "Portfolio has been developed as part of a student group project in a web development bootcamp at the Developer Akademie GmbH. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product. The design of Portfolio is owned by the Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
    "LEGAL_PROPRIETARY_TITLE": "Proprietary rights",
    "LEGAL_PROPRIETARY_TEXT": "Aside from the design owned by Developer Akademie GmbH, we, the listed students, retain all proprietary rights in Portfolio, including any associated copyrighted material, trademarks, and other proprietary information.",
    "LEGAL_USE_TITLE": "Use of the product",
    "LEGAL_USE_TEXT": "Portfolio is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of Portfolio for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of Portfolio.",
    "LEGAL_DISCLAIMER_TITLE": "Disclaimer of warranties and limitation of liability",
    "LEGAL_DISCLAIMER_TEXT": "Portfolio is provided \"as is\" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the Developer Akademie, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of Portfolio.",
    "LEGAL_INDEMNITY_TITLE": "Indemnity",
    "LEGAL_INDEMNITY_TEXT": "You agree to indemnify, defend and hold harmless us, the listed students, the Developer Akademie, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of Portfolio and/or your breach of this Legal Notice. For any questions or notices, please contact us at davideisenbarth@gmail.com. Date: January 14, 2026",
    "PRIVACY_TITLE": "Privacy Policy",
    "PRIVACY_SECTION1_TITLE": "1. Data Protection at a Glance",
    "PRIVACY_SECTION1_GENERAL_TITLE": "General Information",
    "PRIVACY_SECTION1_GENERAL_TEXT": "The following information provides a simple overview of what happens to your personal data when you visit this website. Personal data is any data with which you can be personally identified.",
    "PRIVACY_SECTION1_COLLECTION_TITLE": "Data Collection on This Website",
    "PRIVACY_SECTION1_COLLECTION_TEXT1": "Data processing is carried out by the website operator. Contact details can be found below.",
    "PRIVACY_SECTION1_COLLECTION_TEXT2": "Your data is collected when you provide it to us (e.g. via contact forms). Other data is collected automatically or after your consent by our IT systems (e.g. browser type, operating system, time of page access).",
    "PRIVACY_SECTION1_COLLECTION_TEXT3": "To ensure proper operation of the website and to process inquiries.",
    "PRIVACY_SECTION1_COLLECTION_TEXT4": "You have the right to access, rectification, erasure, restriction of processing, data portability, and to lodge a complaint with a supervisory authority.",
    "PRIVACY_SECTION2_TITLE": "2. Hosting",
    "PRIVACY_SECTION2_TEXT1": "This website is hosted externally. Personal data is stored on the servers of the hosting provider.",
    "PRIVACY_SECTION2_PROVIDER_LABEL": "Hosting provider:",
    "PRIVACY_SECTION2_PROVIDER_NAME": "InfinityFree",
    "PRIVACY_SECTION2_PROVIDER_ADDRESS": "Kwikstaartlaan 42, Unit G1517",
    "PRIVACY_SECTION2_PROVIDER_CITY": "3704 GS Zeist, Netherlands",
    "PRIVACY_SECTION2_PROVIDER_WEBSITE": "https://www.infinityfree.com",
    "PRIVACY_SECTION3_TITLE": "3. Data Controller",
    "PRIVACY_SECTION3_NAME": "David Eisenbarth",
    "PRIVACY_SECTION3_ADDRESS": "Hauptstraße 1a",
    "PRIVACY_SECTION3_CITY": "37339 Berlingerode, Germany",
    "PRIVACY_SECTION3_PHONE": "Phone: +49 151 22264080",
    "PRIVACY_SECTION3_EMAIL": "Email: davideisenbarth@gmail.com",
    "PRIVACY_SECTION4_TITLE": "4. Cookies",
    "PRIVACY_SECTION4_TEXT": "This website uses cookies. Cookies are small text files stored on your device. Essential cookies are processed based on Art. 6(1)(f) GDPR.",
    "PRIVACY_SECTION5_TITLE": "5. Contact Form",
    "PRIVACY_SECTION5_TEXT": "If you contact us via a form, your data will be stored for processing your request. Your data will not be shared without your consent.",
    "PRIVACY_SECTION6_TITLE": "6. Social Media",
    "PRIVACY_SECTION6_TEXT": "This website uses social media plugins (e.g. Facebook) via the privacy-friendly Shariff solution. Data transfer only occurs after explicit consent.",
    "PRIVACY_SECTION7_TITLE": "7. Google Fonts",
    "PRIVACY_SECTION7_TEXT": "Google Fonts are hosted locally. No connection to Google servers is established.",
    "WHY_ME_TITLE": "Why me",
    "WHY_ME_REMOTE_HIGHLIGHT": "I am",
    "WHY_ME_REMOTE_TEXT_1": "open to",
    "WHY_ME_REMOTE_TEXT_2": "work remote from Berlingerode!",
    "WHY_ME_DESCRIPTION": "I am passionate about programming because it combines analytical thinking with creativity. Frontend development especially motivates me, as it allows me to turn technical solutions into user-friendly and visually appealing interfaces. Challenges encourage me to think in a solution-oriented way and to work persistently until problems are resolved. Through my training as a Frontend Developer, I have also learned the importance of teamwork and collaboration in order to create efficient and well-structured solutions together.",
    "WHY_ME_BUTTON": "Let's talk!"
}